controllers/AdminController.php

    public function actionCreate()
    {
        $model = new ProductsCreateForm();

            if ($model->load(Yii::$app->request->post())) {

                $model->photo = UploadedFile::getInstance($model, 'photo');
                $newFileName = md5($model->photo->baseName . '.' . $model->photo->extension. time()).'.'. $model->photo->extension;
                $model->photo->saveAs('@app/web/images/' . $newFileName);
                $model->photo = $newFileName;
                $model->save();
                return $this->redirect(['../web/products']);
            }

            $categories = Category::find()->all();
---
SELECT * FROM `category`