controllers/SiteController.php

SELECT * FROM `products` ORDER BY `time_stamp` DESC LIMIT 5
---
    public function actionAbout()
    {
        $products = Products::find()->orderBy(['time_stamp' => SORT_DESC])->limit(5)->all();